<script setup>
import {Swiper,SwiperSlide} from "swiper/vue";
import 'swiper/swiper-bundle.css';
import {
  goodArticle,
  handleLoaded,
  resetData,
  swiper_game,
  swiperImage
} from "@/special_assets/js/game_main_index.js";
import {onMounted, onUnmounted} from "vue";
import {onImageError} from "@/utils/utils.js";
const props = defineProps({
  data:{
    type:Object,
    required:true
  }
})
onUnmounted(()=>{
  resetData()
})
onMounted(()=>{
})

</script>

<template>
  <div class="channel_layout main_part">
    <div class="game_carousel_popover swiper-no-swiping">
      <swiper :loop="swiper_game.loop" :autoplay="swiper_game.autoplay"  :pagination="swiper_game.pagination"
              :slidesPerView="swiper_game.slidesPerView" :centered-slides="swiper_game.centeredSlides"
              :navigation="swiper_game.navigation" :round-lengths="swiper_game.roundLengths"
      :effect="swiper_game.effect" :coverflow-effect="swiper_game.coverflowEffect" :looped-slides="swiper_game.loopedSlides">
        <swiper-slide  class="swiper_slide_size" v-for="(slide,index) in swiperImage" :key="index">
          <a class="img_inner">
            <picture class="v-img" :class="{image_loading:!swiperImage[index].hasLoaded}">
              <source :srcset="slide.src" type="image/avif">
              <img :src="slide.src" :alt="slide.alt" @load="handleLoaded(index)"/>
            </picture>
            <div class="v_img_mask">
              <p class="v_img_alt_test">{{slide.alt}}</p>
            </div>
          </a>
        </swiper-slide>
        <div class="swiper_button_popover">
          <div class="swiper_button_inner">
            <button class="swiper-button-prev swiper-button-style"></button>
            <button class="swiper-button-next swiper-button-style"></button>
          </div>
        </div>
      </swiper>
      <div class="swiper-pagination"></div>
    </div>
    <div class="game_gird_popover">
      <div class="game_featured_entry">
        <div class="game_header">
          <span class="game_header_test">文章精选</span>
        </div>
        <div class="game_card_left_body">
          <div v-for="(article,index) in goodArticle" :key="index" class="big_card_popover">
            <div class="big_card_skeleton">
              <div class="big_card_skeleton__cover">
                <div class="big_card_skeleton__cover_inner"></div>
              </div>
              <div class="big_card_skeleton__right">
                <div class="big_card_skeleton__right_inner">
                  <p class="big_card_skeleton__title"></p>
                  <p class="big_card_skeleton__title short"></p>
                </div>
                <div class="big_card_skeleton__article_where"></div>
                <div class="big_card_skeleton__data_box">
                  <div class="big_card_skeleton__data"></div>
                </div>
              </div>
              <div class="big_card_skeleton__bottom">
                <div class="big_card_skeleton__bottom_inner">
                  <p class="big_card_skeleton___desc"></p>
                  <p class="big_card_skeleton___desc short"></p>
                  <p class="big_card_skeleton__light"></p>
                </div>
              </div>
            </div>
            <div class="big_card">
              <div class="big_card_wrap">
                <a class="big_card_image_link">
                  <div class="big_card_image_popover">
                    <picture class="v-image big_card_image_entry">
                      <img :src="article.pic" :alt="article.alt" @error="onImageError(article)">
                    </picture>
                  </div>
                </a>
              </div>
              <div class="big_card__right">
                <div class="big_card__right_entry">
                  <div class="big_card__title">
                    <h2 class="big_card__title_test">
                      <a style="font-weight: inherit">{{article.alt}}</a>
                    </h2>
                  </div>
                </div>
                <div class="big_card__right_where">
                  <svg class="big_card__from_svg" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" width="20" height="20">
                    <path d="M260.651401 207.933823c3.074263-6.148527 130.248382 109.816033 210.262883 211.475858 129.077234 164.002539-117.930416 136.522389-246.108376 299.332867-60.899693 77.358505 0.878361 271.016183 418.141644 261.939786-6.399487-3.17883-338.963677-145.285085-59.728545-235.756264 127.153206-41.199312 267.670046-142.691829 179.206549-327.419505-40.613738-84.803659-149.467757-166.616709-274.780587-248.848025-109.585986-71.921032-131.41953-78.592393-131.41953-78.592393l-95.574038 117.867676z" fill="#CED3FF"></path>
                    <path d="M277.486653 204.064852l99.505748-117.846762 76.584711 71.502765-87.501483 108.665798-88.588976-62.321801z" fill="#FFFFFF"></path>
                    <path d="M309.902355 231.440435l-76.27101-1.171148S203.139671 211.259047 209.727379 164.789569C215.353071 125.326066 241.20198 20.299191 353.109349 20.717458c0 0 67.445574 66.211686 36.096452 136.752436l-79.303446 73.970541z" fill="#CED3FF"></path>
                  </svg>
                  <h3 class="big_card__from_test">
                    <a>{{article.category}}</a>
                  </h3>
                </div>
                <div class="big_card__right_data_box">
                  <div class="big_card__right_data">
                    <div class="big_card__data_margin">
                      <svg class="big_card__data_icon" viewBox="0 0 1024 1024" fill="currentColor" version="1.1" xmlns="http://www.w3.org/2000/svg" width="20" height="20">
                        <g fill="currentColor">
                          <path d="M939.358251 423.424662c-23.01825-37.252439-62.924121-60.779272-107.019409-63.209624-2.755764-0.38681-5.510504-0.579191-8.347109-0.579191l-152.202471-0.121773c6.649444-28.975938 10.015098-58.653865 10.015098-88.657202 0-28.223808-3.213181-57.139372-9.556657-85.952604-0.447185-2.043542-1.098008-4.006244-1.932002-5.866614-15.820314-57.302077-67.37755-96.841605-127.282918-96.841605-72.827679 0-132.081201 59.254545-132.081201 132.081201 0 3.334955 0.132006 6.66991 0.406253 10.015098-2.196015 57.211003-32.108279 109.947088-80.269162 141.363611-14.447037 9.42465-18.524912 28.773324-9.099239 43.220361 9.414417 14.437827 28.752858 18.535145 43.220361 9.099239 65.811892-42.925648 106.429984-115.325585 108.656699-193.684234 0.030699-1.332345-0.010233-2.663666-0.14224-3.996011-0.203638-2.012843-0.304945-4.016477-0.304945-6.019087 0-38.381146 31.233352-69.614497 69.614497-69.614497 32.57593 0 60.474326 22.204721 67.824735 53.997821 0.356111 1.534959 0.823761 3.019777 1.402953 4.453429 4.696975 22.814612 7.076162 45.579081 7.076162 67.743894 0 37.485753-6.222725 74.352405-18.494213 109.592001-3.324722 9.546424-1.819438 20.111037 4.02671 28.345582 5.856381 8.245801 15.332197 13.146415 25.448602 13.156648l193.226816 0.101307c1.423419 0.264013 2.857071 0.426719 4.300956 0.477884 24.116257 0.9967 45.935192 13.614066 58.603723 34.090423 7.838525 12.31242 11.438517 26.800389 10.431583 41.939181-0.080841 0.945535-0.121773 1.911536-0.11154 2.877537 0 0.854461 0.040932 1.697665 0.11154 2.53166 0.010233 0.335644-0.030699 0.661056-0.11154 0.976234-0.101307 0.376577-0.193405 0.772596-0.284479 1.159406l-74.972529 330.391802c-0.914836 1.281179-1.738597 2.6432-2.449795 4.046153-5.937223 11.762905-14.660908 21.48329-25.346271 28.172643-10.746762 6.812149-23.059182 10.614755-35.757388 11.06194-0.854461-0.061398-513.766226-0.224104-513.766226-0.224104-0.467651-0.020466-0.935302-0.030699-1.402953-0.030699 0 0-111.01542 0.172939-112.718201 0.457418-1.932002 0-3.446495-1.50426-3.446495-3.415796l0.299829-416.334173c0-1.901303 1.545192-3.446495 3.01466-3.456728l1.245364 0.121773c1.174756 0.132006 2.653433 0.284479 3.52836 0.193405l83.82822-0.222057 0 339.367221c0 17.253966 13.979386 31.233352 31.233352 31.233352s31.233352-13.979386 31.233352-31.233352L281.009092 435.350273c0-1.778506 0-8.631588 0-10.411117 0-17.253966-13.979386-30.928407-31.233352-30.928407-1.50426 0-117.547183 0.304945-119.402437 0.304945-36.34272 0-65.913199 29.566386-65.913199 65.893756l-0.299829 416.334173c0 36.337603 29.571503 65.902966 65.913199 65.902966 2.541893 0 111.406323-0.457418 111.406323-0.457418 0.457418 0.020466 0.925069 0.030699 1.382487 0.030699 0 0 511.458671 0.274246 512.505513 0.274246 25.469068 0 50.296523-7.197936 71.647807-20.73116 19.612687-12.281721 35.777855-29.881564 46.839795-50.967812 3.660366-5.622044 6.435573-11.875468 8.256034-18.615986 0.11154-0.416486 0.213871-0.823761 0.304945-1.240247l74.881454-330.340637c1.596358-6.212492 2.257413-12.586666 2.00261-18.992563C960.892707 473.366098 953.948551 446.331371 939.358251 423.424662z"></path>
                          <path d="M450.027553 518.650467c-17.253966 0-31.233352 13.979386-31.233352 31.233352l0 30.470989c0 17.253966 13.979386 31.233352 31.233352 31.233352 17.253966 0 31.233352-13.979386 31.233352-31.233352l0-30.470989C481.260905 532.629853 467.281519 518.650467 450.027553 518.650467z"></path>
                          <path d="M693.805696 518.650467c-17.253966 0-31.233352 13.979386-31.233352 31.233352l0 30.470989c0 17.253966 13.979386 31.233352 31.233352 31.233352 17.253966 0 31.233352-13.979386 31.233352-31.233352l0-30.470989C725.039048 532.629853 711.058638 518.650467 693.805696 518.650467z" fill="#2c2c2c" p-id="6134"></path><path d="M648.940882 660.09492c-14.304797-9.393951-33.592073-5.398964-43.159986 8.763594-0.132006 0.193405-13.614066 19.754926-34.171264 19.754926-19.98824 0-32.423457-18.09717-33.266661-19.368116-9.17087-14.427594-28.254507-18.809391-42.834574-9.770528-14.650675 9.109472-19.155269 28.366048-10.055007 43.016723 11.214413 18.047028 41.96988 48.588625 86.156242 48.588625 43.962258 0 75.104535-30.318516 86.572728-48.222281C667.404396 688.461991 663.216004 669.500127 648.940882 660.09492z"></path>
                        </g>
                      </svg>
                      <span class="big_card__data_test">{{article.like}}</span>
                    </div>
                    <div class="big_card__data_margin">
                      <svg class="big_card__data_icon review" viewBox="0 0 1024 1024" fill="currentColor" version="1.1" xmlns="http://www.w3.org/2000/svg" width="20" height="20">
                        <g fill="currentColor">
                          <path d="M842 182H182c-66 0-120 54-120 120v420c0 66 54 120 120 120h660c66 0 120-54 120-120V302c0-66-54-120-120-120z m30 510c0 33-27 60-60 60H212c-33 0-60-27-60-60V332c0-33 27-60 60-60h600c33 0 60 27 60 60v360z"></path>
                          <path d="M302 512m-60 0a60 60 0 1 0 120 0 60 60 0 1 0-120 0Z"></path>
                          <path d="M512 512m-60 0a60 60 0 1 0 120 0 60 60 0 1 0-120 0Z"></path>
                          <path d="M722 512m-60 0a60 60 0 1 0 120 0 60 60 0 1 0-120 0Z"></path>
                        </g>
                      </svg>
                      <span class="big_card__data_test review">{{article.review}}</span>
                    </div>
                    <div class="big_card__data_margin final_data">
                      <svg class="big_card__data_icon visitor" viewBox="0 0 1024 1024" fill="currentColor" version="1.1" xmlns="http://www.w3.org/2000/svg" width="20" height="20">
                        <g fill="currentColor">
                          <path d="M1006.08 498.688c-88.064-192.512-282.112-316.928-493.568-316.928S106.496 306.176 18.432 498.688c-3.584 8.192-3.584 17.408 0 25.6 88.064 192.512 282.112 316.928 493.568 316.928s405.504-124.416 493.568-316.928c4.096-8.192 4.096-17.408 0.512-25.6zM512 779.776c-183.296 0-351.232-104.96-431.616-268.288C161.28 348.16 329.216 243.2 512 243.2c183.296 0 351.232 104.96 431.616 268.288-80.384 163.84-248.32 268.288-431.616 268.288z"></path>
                          <path d="M512 358.4c-84.48 0-153.088 68.608-153.088 153.088s68.608 153.088 153.088 153.088 153.088-68.608 153.088-153.088S596.48 358.4 512 358.4z m0 244.736c-50.688 0-91.648-40.96-91.648-91.648 0-50.688 40.96-91.648 91.648-91.648s92.16 40.96 92.16 91.648c0 50.688-41.472 91.648-92.16 91.648z"></path>
                        </g>
                      </svg>
                      <span class="big_card__data_test">{{article.visitor}}</span>
                    </div>
                  </div>
                </div>
              </div>
              <div class="big_card_entry">
                <div class="big_card__desc">
                  <h3 class="big_card__desc_test">
                    <a>{{ article.desc }}</a>
                  </h3>
                  <div class="big_card__final">
                    <a class="big-card__author">
                      <svg class="big_card__author_icon" fill="currentColor" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3490" width="20" height="20"><g data-v-4ebb6f0b="" fill="currentColor"><path data-v-4ebb6f0b="" d="M825.6 951.04h-614.4c-73.4208 0-133.12-59.6992-133.12-133.12v-614.4c0-73.4208 59.6992-133.12 133.12-133.12h614.4c73.4208 0 133.12 59.6992 133.12 133.12v614.4c0 73.4208-59.7504 133.12-133.12 133.12z m-614.4-819.2c-39.5264 0-71.68 32.1536-71.68 71.68v614.4c0 39.5264 32.1536 71.68 71.68 71.68h614.4c39.5264 0 71.68-32.1536 71.68-71.68v-614.4c0-39.5264-32.1536-71.68-71.68-71.68h-614.4z"></path><path data-v-4ebb6f0b="" d="M518.4 520.96c-93.184 0-168.96-75.776-168.96-168.96s75.776-168.96 168.96-168.96 168.96 75.776 168.96 168.96-75.8272 168.96-168.96 168.96z m0-276.48c-59.2896 0-107.52 48.2304-107.52 107.52s48.2304 107.52 107.52 107.52 107.52-48.2304 107.52-107.52-48.2304-107.52-107.52-107.52z"></path><path data-v-4ebb6f0b="" d="M603.3408 843.52H433.4592c-104.0896 0-188.7232-84.6848-188.7232-188.7232v-55.4496c0-39.2704 15.9232-77.312 43.7248-104.448 24.1664-23.6544 64.3584-56.1152 118.8352-76.5952a30.72 30.72 0 0 1 21.6576 57.4976c-44.4416 16.7424-77.568 43.52-97.536 63.0272-16.0256 15.6672-25.2416 37.7344-25.2416 60.5184v55.4496c0 70.1952 57.088 127.2832 127.2832 127.2832h169.8816c70.1952 0 127.2832-57.088 127.2832-127.2832v-55.4496c0-22.784-9.1648-44.8512-25.1904-60.5184-19.968-19.5584-53.0944-46.336-97.536-63.0784a30.72 30.72 0 0 1 21.6576-57.4976c54.4256 20.48 94.6688 52.992 118.8352 76.6464 27.7504 27.136 43.6736 65.1776 43.6736 104.448v55.4496c0 104.0896-84.6848 188.7232-188.7232 188.7232z"></path><path data-v-4ebb6f0b="" d="M518.4 720.64c-46.2848 0-83.9168-32.8192-83.9168-73.1136V645.12l0.3584-2.3552c0.256-1.5872 6.2976-39.8848 16.128-78.848 15.0528-59.5968 32.3072-99.2768 67.3792-99.2768s52.3264 39.68 67.3792 99.2768c9.8816 38.9632 15.9232 77.2608 16.128 78.848l0.3584 2.3552v2.4064c0.1024 40.3456-37.5808 73.1136-83.8144 73.1136zM496.128 648.704c1.3824 4.2496 9.5744 10.496 22.272 10.496s20.8896-6.2976 22.272-10.496c-5.8368-35.9936-14.336-72.4992-22.272-97.3824-7.936 24.8832-16.4864 61.3888-22.272 97.3824z"></path></g></svg>
                      <span class="big_card__author_name">{{ article.author }}</span>
                      <span class="big_card__author_date">{{ article.pubDate }}</span>
                    </a>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div class="game_relate_update_entry">
        <div class="game_header">
          <span class="game_header_test">最近更新</span>
        </div>
        <div class="game_card_right_body">
          <div class="feed_card_popover">
            <div class="card_skeleton hide">
              <div class="card_skeleton__cover"></div>
              <div class="card_skeleton__info">
                <div class="card_skeleton__info_inner">
                  <p class="card_skeleton__info_test"></p>
                  <p class="card_skeleton__info_test short"></p>
                  <p class="card_skeleton__info_light"></p>
                </div>
              </div>
            </div>
            <div class="card_wrap">
                <a class="card_image_link">
                  <div class="card_image_popover">
                    <picture class="v-image card_picture_entry">
                      <img src="@/assets/image/common-cover_1.avif" alt="【预告】「面对校园网的多设备检测，我的解决方案是」">
                    </picture>
                  </div>
                </a>
                <div class="card_info_entry">
                  <div class="card_info_inner">
                    <h3 class="card_info_title" title="会不会影响考公">
                      <a>不影响考公，再长一点会不会有事啊，再长一点会不会有事啊，再长一点会不会有事啊，再长一点会不会有事啊，再长一点会不会有事啊</a>
                    </h3>
                    <div class="card_info__button">
                      <a class="card_info__author">
                        <svg class="card_info__author_icon" fill="currentColor" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3490" width="20" height="20">
                          <g fill="currentColor">
                            <path d="M825.6 951.04h-614.4c-73.4208 0-133.12-59.6992-133.12-133.12v-614.4c0-73.4208 59.6992-133.12 133.12-133.12h614.4c73.4208 0 133.12 59.6992 133.12 133.12v614.4c0 73.4208-59.7504 133.12-133.12 133.12z m-614.4-819.2c-39.5264 0-71.68 32.1536-71.68 71.68v614.4c0 39.5264 32.1536 71.68 71.68 71.68h614.4c39.5264 0 71.68-32.1536 71.68-71.68v-614.4c0-39.5264-32.1536-71.68-71.68-71.68h-614.4z"></path><path d="M518.4 520.96c-93.184 0-168.96-75.776-168.96-168.96s75.776-168.96 168.96-168.96 168.96 75.776 168.96 168.96-75.8272 168.96-168.96 168.96z m0-276.48c-59.2896 0-107.52 48.2304-107.52 107.52s48.2304 107.52 107.52 107.52 107.52-48.2304 107.52-107.52-48.2304-107.52-107.52-107.52z"></path><path d="M603.3408 843.52H433.4592c-104.0896 0-188.7232-84.6848-188.7232-188.7232v-55.4496c0-39.2704 15.9232-77.312 43.7248-104.448 24.1664-23.6544 64.3584-56.1152 118.8352-76.5952a30.72 30.72 0 0 1 21.6576 57.4976c-44.4416 16.7424-77.568 43.52-97.536 63.0272-16.0256 15.6672-25.2416 37.7344-25.2416 60.5184v55.4496c0 70.1952 57.088 127.2832 127.2832 127.2832h169.8816c70.1952 0 127.2832-57.088 127.2832-127.2832v-55.4496c0-22.784-9.1648-44.8512-25.1904-60.5184-19.968-19.5584-53.0944-46.336-97.536-63.0784a30.72 30.72 0 0 1 21.6576-57.4976c54.4256 20.48 94.6688 52.992 118.8352 76.6464 27.7504 27.136 43.6736 65.1776 43.6736 104.448v55.4496c0 104.0896-84.6848 188.7232-188.7232 188.7232z"></path><path d="M518.4 720.64c-46.2848 0-83.9168-32.8192-83.9168-73.1136V645.12l0.3584-2.3552c0.256-1.5872 6.2976-39.8848 16.128-78.848 15.0528-59.5968 32.3072-99.2768 67.3792-99.2768s52.3264 39.68 67.3792 99.2768c9.8816 38.9632 15.9232 77.2608 16.128 78.848l0.3584 2.3552v2.4064c0.1024 40.3456-37.5808 73.1136-83.8144 73.1136zM496.128 648.704c1.3824 4.2496 9.5744 10.496 22.272 10.496s20.8896-6.2976 22.272-10.496c-5.8368-35.9936-14.336-72.4992-22.272-97.3824-7.936 24.8832-16.4864 61.3888-22.272 97.3824z"></path>
                          </g>
                        </svg>
                        <span class="card_info__author_name" title="测试测试测试测试">测试测试测试测试</span>
                        <span class="card_info__date">2-23</span>
                      </a>
                    </div>
                  </div>
                </div>
              </div>
          </div>
          <div class="feed_card_popover">
            <div class="card_skeleton hide">
              <div class="card_skeleton__cover"></div>
              <div class="card_skeleton__info">
                <div class="card_skeleton__info_inner">
                  <p class="card_skeleton__info_test"></p>
                  <p class="card_skeleton__info_test short"></p>
                  <p class="card_skeleton__info_light"></p>
                </div>
              </div>
            </div>
            <div class="card_wrap">
              <a class="card_image_link">
                <div class="card_image_popover">
                  <picture class="v-image card_picture_entry">
                    <img src="@/assets/image/common-cover_1.avif" alt="【预告】「面对校园网的多设备检测，我的解决方案是」">
                  </picture>
                </div>
              </a>
              <div class="card_info_entry">
                <div class="card_info_inner">
                  <h3 class="card_info_title" title="会不会影响考公">
                    <a>不影响考公，再长一点会不会有事啊，再长一点会不会有事啊，再长一点会不会有事啊，再长一点会不会有事啊，再长一点会不会有事啊</a>
                  </h3>
                  <div class="card_info__button">
                    <a class="card_info__author">
                      <svg class="card_info__author_icon" fill="currentColor" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3490" width="20" height="20">
                        <g fill="currentColor">
                          <path d="M825.6 951.04h-614.4c-73.4208 0-133.12-59.6992-133.12-133.12v-614.4c0-73.4208 59.6992-133.12 133.12-133.12h614.4c73.4208 0 133.12 59.6992 133.12 133.12v614.4c0 73.4208-59.7504 133.12-133.12 133.12z m-614.4-819.2c-39.5264 0-71.68 32.1536-71.68 71.68v614.4c0 39.5264 32.1536 71.68 71.68 71.68h614.4c39.5264 0 71.68-32.1536 71.68-71.68v-614.4c0-39.5264-32.1536-71.68-71.68-71.68h-614.4z"></path><path d="M518.4 520.96c-93.184 0-168.96-75.776-168.96-168.96s75.776-168.96 168.96-168.96 168.96 75.776 168.96 168.96-75.8272 168.96-168.96 168.96z m0-276.48c-59.2896 0-107.52 48.2304-107.52 107.52s48.2304 107.52 107.52 107.52 107.52-48.2304 107.52-107.52-48.2304-107.52-107.52-107.52z"></path><path d="M603.3408 843.52H433.4592c-104.0896 0-188.7232-84.6848-188.7232-188.7232v-55.4496c0-39.2704 15.9232-77.312 43.7248-104.448 24.1664-23.6544 64.3584-56.1152 118.8352-76.5952a30.72 30.72 0 0 1 21.6576 57.4976c-44.4416 16.7424-77.568 43.52-97.536 63.0272-16.0256 15.6672-25.2416 37.7344-25.2416 60.5184v55.4496c0 70.1952 57.088 127.2832 127.2832 127.2832h169.8816c70.1952 0 127.2832-57.088 127.2832-127.2832v-55.4496c0-22.784-9.1648-44.8512-25.1904-60.5184-19.968-19.5584-53.0944-46.336-97.536-63.0784a30.72 30.72 0 0 1 21.6576-57.4976c54.4256 20.48 94.6688 52.992 118.8352 76.6464 27.7504 27.136 43.6736 65.1776 43.6736 104.448v55.4496c0 104.0896-84.6848 188.7232-188.7232 188.7232z"></path><path d="M518.4 720.64c-46.2848 0-83.9168-32.8192-83.9168-73.1136V645.12l0.3584-2.3552c0.256-1.5872 6.2976-39.8848 16.128-78.848 15.0528-59.5968 32.3072-99.2768 67.3792-99.2768s52.3264 39.68 67.3792 99.2768c9.8816 38.9632 15.9232 77.2608 16.128 78.848l0.3584 2.3552v2.4064c0.1024 40.3456-37.5808 73.1136-83.8144 73.1136zM496.128 648.704c1.3824 4.2496 9.5744 10.496 22.272 10.496s20.8896-6.2976 22.272-10.496c-5.8368-35.9936-14.336-72.4992-22.272-97.3824-7.936 24.8832-16.4864 61.3888-22.272 97.3824z"></path>
                        </g>
                      </svg>
                      <span class="card_info__author_name" title="测试测试测试测试">测试测试测试测试</span>
                      <span class="card_info__date">2-23</span>
                    </a>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<style src="@/special_assets/css/game_main_index.css" scoped>

</style>
<style>
.swiper-slide{
  border-radius: 8px!important;
  cursor: pointer;
}
.swiper-pagination{
  bottom: 0!important;
  line-height: 0;
}
</style>
